
## :x: Apply Failed (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8670644933)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.public_image_bucket will be created
  + resource "google_storage_bucket" "public_image_bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "lgtm-public-image-bucket"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
            ]
          + origin          = [
              + null,
            ]
          + response_header = [
              + "*",
            ]
        }
    }

  # google_storage_bucket_access_control.public_image_bucket will be created
  + resource "google_storage_bucket_access_control" "public_image_bucket" {
      + bucket = "lgtm-public-image-bucket"
      + domain = (known after apply)
      + email  = (known after apply)
      + entity = "allUsers"
      + id     = (known after apply)
      + role   = "READER"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
google_storage_bucket.public_image_bucket: Creating...
google_storage_bucket.public_image_bucket: Creation complete after 2s [id=lgtm-public-image-bucket]
google_storage_bucket_access_control.public_image_bucket: Creating...
╷
│ Error: Error creating BucketAccessControl: googleapi: Error 400: Cannot use ACL API to update bucket policy when uniform bucket-level access is enabled. Read more at https://cloud.google.com/storage/docs/uniform-bucket-level-access, invalid
│ 
│   with google_storage_bucket_access_control.public_image_bucket,
│   on gcs.tf line 1, in resource "google_storage_bucket_access_control" "public_image_bucket":
│    1: resource "google_storage_bucket_access_control" "public_image_bucket" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":3,"Program":"tfcmt","SHA1":"b6c69a724ccf8e26f6c01b83c5a3d07353591feb","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->